[
  {
    "id": 1,
    "logo": "./assets/All Images/facebook-logo.png",
    "title": "Software Engineer",
    "company": "Facebook",
    "job_type": [
      "Full Time",
      "Remote"
    ],
    "category": "Full Time",
    "responsibility": "Design and implement robust and scalable software applications using Java and Python, collaborating with cross-functional teams to meet project goals and deadlines.",
    "experience": "5+ years of hands-on software development experience with a strong emphasis on system design and architecture.",
    "job_description": "We are looking for a talented software engineer to join our dynamic team and play a key role in shaping the future of Facebook products. The ideal candidate will contribute to the entire software development lifecycle, from concept to delivery.",
    "educational_description": "Bachelor's or Master's degree in Computer Science or a related field is required. A solid academic foundation combined with practical experience in software development will be highly valued.",
    "location": "Menlo Park, CA",
    "salary": "150k- 200k",
    "contact_information": {
      "phone": "555-123-4567",
      "email": "recruiting@facebook.com",
      "address": "1 Hacker Way, Menlo Park, CA 94025"
    }
  },
  {
    "id": 2,
    "logo": "./assets/All Images/amazon-logo.png",
    "title": "Data Analyst",
    "company": "Amazon",
    "job_type": [
      "On Site",
      "Full Time"
    ],
    "category": "On Site",
    "responsibility": "Analyze large sets of data to identify trends and patterns that will help inform business decisions. Collaborate with cross-functional teams to translate data insights into actionable recommendations.",
    "experience": "2+ years of hands-on experience in data analysis, with a proven track record of delivering impactful insights and reports.",
    "job_description": "We are seeking a highly motivated and detail-oriented data analyst to join our team and help us optimize our operations through data-driven decision-making. The successful candidate will play a crucial role in extracting meaningful insights from complex datasets, driving business strategies, and contributing to the continuous improvement of our processes.",
    "educational_description": "Bachelor's or Master's degree in Statistics, Mathematics, Economics, or a related field. Strong analytical skills and a solid understanding of statistical methods are essential for success in this role.",
    "location": "Seattle, WA",
    "salary": "80k - 120k",
    "contact_information": {
      "phone": "555-234-5678",
      "email": "recruiting@amazon.com",
      "address": "410 Terry Ave N, Seattle, WA 98109"
    }
  },
  {
    "id": 3,
    "logo": "./assets/All Images/google-1-1 1.png",
    "title": "Product Manager",
    "company": "Google",
    "job_type": [
      "Full Time",
      "Part Time"
    ],
    "category": "Part Time",
    "responsibility": "Develop and execute a comprehensive product roadmap to meet business objectives, enhance user experience, and drive sustainable user engagement. Lead cross-functional teams in the successful delivery of product features and improvements.",
    "experience": "5+ years of proven experience in product management, with a strong track record of successfully launching and managing products throughout their lifecycle.",
    "job_description": "We are seeking an experienced and visionary product manager to join our dynamic team at Google. The successful candidate will play a pivotal role in shaping the future of our products, driving innovation, and ensuring the delivery of high-quality solutions that meet and exceed user expectations.",
    "educational_description": "Bachelor's or Master's degree in Computer Science, Business, or a related field. An MBA or equivalent business qualification is a plus. A combination of strong business acumen and technical understanding is crucial for success in this role.",
    "location": "Mountain View, CA",
    "salary": "120k - 180k",
    "contact_information": {
      "phone": "555-345-6789",
      "email": "recruiting@google.com",
      "address": "1600 Amphitheatre Parkway, Mountain View, CA 94043"
    }
  },
  {
    "id": 4,
    "logo": "./assets/All Images/tesla-9 1.png",
    "title": "Backend Developer",
    "company": "Tesla",
    "job_type": [
      "Part Time",
      "On Site"
    ],
    "category": "On Site",
    "responsibility": "Develop and maintain scalable and efficient backend systems to support the functionality of Tesla's electric vehicles and energy products. Collaborate with cross-functional teams to integrate backend solutions seamlessly into the overall architecture.",
    "experience": "3+ years of hands-on experience with backend development, including expertise in designing and implementing robust APIs and microservices.",
    "job_description": "We are seeking a highly skilled backend developer to join our innovative team at Tesla. The successful candidate will play a critical role in shaping the future of sustainable transportation and energy solutions by developing and maintaining the backend systems that power our electric vehicles and energy products.",
    "educational_description": "Bachelor's or higher degree in Computer Science or a related field. Continual learning and staying updated with the latest trends in backend development are highly encouraged.",
    "location": "Palo Alto, CA",
    "salary": "120k - 150k",
    "contact_information": {
      "phone": "555-555-5555",
      "email": "jobs@tesla.com",
      "address": "123 Main St, Palo Alto, CA"
    }
  },
  {
    "id": 5,
    "logo": "./assets/All Images/netflix-4 1.png",
    "title": "Machine Learning Engineer",
    "company": "Netflix",
    "job_type": [
      "Remote",
      "Full Time"
    ],
    "category": "Full Time",
    "responsibility": "Develop and deploy cutting-edge machine learning models to enhance and personalize the Netflix customer experience. Collaborate with cross-functional teams to integrate machine learning solutions into our platform.",
    "experience": "5+ years of hands-on experience in machine learning, with a proven track record of successfully developing and deploying production-ready models.",
    "job_description": "Netflix is seeking a highly skilled Machine Learning Engineer to join our dynamic team. The successful candidate will play a crucial role in advancing our machine learning capabilities, contributing to the personalization and improvement of our streaming service. This position offers an exciting opportunity to work on innovative projects at the intersection of entertainment and technology.",
    "educational_description": "Master's or PhD in Computer Science or a related field. A strong academic background and a deep understanding of machine learning concepts and algorithms are essential for success in this role.",
    "location": "Remote",
    "salary": "150k - 200k",
    "contact_information": {
      "phone": "555-555-5555",
      "email": "jobs@netflix.com",
      "address": "123 Main St, Los Gatos, CA"
    }
  },
  {
    "id": 6,
    "logo": "./assets/All Images/Group 10021.png",
    "title": "Frontend Developer",
    "company": "Airbnb",
    "job_type": [
      "Remote",
      "On Site"
    ],
    "category": "Remote",
    "responsibility": "Develop and maintain scalable and responsive frontend applications to enhance the Airbnb user experience. Collaborate with designers and backend developers to implement intuitive and visually appealing user interfaces.",
    "experience": "3+ years of hands-on experience with frontend development, including proficiency in modern web technologies and frameworks.",
    "job_description": "Airbnb is seeking a highly skilled frontend developer to join our collaborative team. The successful candidate will play a crucial role in developing and maintaining the frontend applications that power our platform, providing users with a seamless and enjoyable experience. This position offers an exciting opportunity to contribute to innovative projects that impact the way people discover and book unique accommodations and experiences.",
    "educational_description": "Bachelor's or higher degree in Computer Science or a related field. A strong foundation in computer science principles and a passion for creating engaging user interfaces are key qualifications for this role.",
    "location": "San Francisco, CA",
    "salary": "130k - 160k",
    "contact_information": {
      "phone": "555-555-5555",
      "email": "jobs@airbnb.com",
      "address": "123 Main St, San Francisco, CA"
    }
  }
]